package l2s.gameserver.utils;

import l2s.commons.util.Rnd;
import l2s.gameserver.Announcements;
import l2s.gameserver.model.GameObjectsStorage;
import l2s.gameserver.model.Player;

import java.util.ArrayList;
import java.util.Collection;
import java.util.List;

public class DropSpecialItemAnnounce {
    public static List<Integer> dropSpecialItems= new ArrayList<>();
    public static String[] wordsSimple= new String[]{
            "珍稀装备出世，你的好运来了！",
            "击杀BOSS，收获无尽财富！",
            "装备爆棚，实力飙升！快来捡战利品！",
            "突破界限，提升实力，这些装备你值得拥有！",
            "闪耀的装备掉落，你的胜利奖赏！",
            "打败敌人，收获他们的装备，让你如虎添翼！",
            "高级装备入手，离最强玩家更近一步！",
            "击杀精英怪，获得梦寐以求的稀有装备！",
            "装备掉落，你的好运正在向你招手！",
            "战斗的奖赏已到，快来捡取你的战利品！",
            "你的运气爆表，新的装备已经出现！",
            "打败对手，解锁隐藏的装备！",
            "稀有装备掉落，你的实力将更上一层楼！",
            "你的战斗成果丰硕，快来领取奖励！",
            "高级装备随机掉落，你的好运就在眼前！",
            "打败强大的BOSS，获得它的珍稀装备！",
            "装备升级，你的战斗力将直线上升！",
            "新的传说装备已经出现，你准备好了吗？",
            "你的努力得到了回报，稀有装备已经入手！",
            "战斗的胜利已经属于你，新的装备正在召唤你！",
            "你的勇武终于得到回报，新的装备在等待你！",
            "稀有装备等待着你的挑战，你准备好了吗？",
            "你的实力得到了最好的证明，新的装备已经到手！",
            "战斗的胜利是你的，新的装备让你的实力暴涨！",
            "你的幸运数字是今天，新的装备已经出现！",
            "打败那些强大的敌人，新的宝藏和装备在等你！",
            "你的勇猛无人能敌，新的装备将助你更上一层楼！",
            "你的技巧和实力得到了认可，新的装备已经加入你的背包！",
            "你的战斗成果丰硕，新的装备让你的实力暴涨！"
    };
    private DropSpecialItemAnnounce(){
        for (int itemId : itemIds) {
            dropSpecialItems.add(itemId);
        }
    }
    private int[] itemIds = new int[]{
		//掉落物品ID列表
        225,297,262,280,159,187,188,189,190,70,2499,322,91890,91905,321,320,318,224,1660,279,261,129,172,90,93,88,158,169,294,319,266,135,205,206,228,299,2503,286,204
		,8678,8679,8680,8681,8683,8685,8687,8686,8684,8682,8688,91887,91902,91882,91896,7886,203,301,303,7891,7897,7888,316,317,278,293,296,223,238,239,241,260,157,186
		,124,127,130,240,97,268,234,287,79,171,175,210,75,76,77,84,134,145,231,233,265,162,174,196,197,199,200,201,202,132,95,283,198,213,164,151,81,270,91888,7895,7902
		,91903,236,305,289,2500,5706,91885,91900,91883,91897,6364,6365,6366,6367,6369,6370,6371,6372,6579,7575,7883,7893,7901,7889,7898,7882,83,144,315,259,86,179,180
		,181,182,183,184,185,275,276,222,292,69,125,126,128,91,92,267,300,78,142,229,243,284,148,73,74,131,133,195,2502,94,282,285,227,242,325,80,98,150,7894,212,235,288
		,7884,2504,269,7899,91889,264,91886,91901,91898,71,72,96,298,302,263,89,160,161,173,191,192,193,194,232,281,226,230,7892,7900,4233,356,438,396,101,312,313,314
		,258,156,167,178,220,274,123,291,166,221,168,353,7887,5311,5316,401,2381,60,352,5326,5329,5320,5323,6680,6684,2392,2391,5293,380,358,442,6674,395,2396,437,351,5301
		,5308,2377,2378,58,349,350,400,2399,2398,2390,2406,914,441,5287,440,357,2376,393,394,436,473,2380,2412,355,6675,417,470,2401,348,59,378,379,913,119,919,851,2414
		,5297,5304,499,2384,2397,420,2411,354,2404,2403,399,630,2494,472,433,434,435,392,398,5288,61,607,1125,2427,2428,2451,469,415,416,383,2379,850,855,857,926,5312
		,5317,382,2416,2417,6326,917,912,6683,6687,347,377,439,397,2497,517,1149,882,603,2437,2438,2461,2462,2463,2468,1128,629,2493,6726,47,606,1124,2424,2425,2426,2448
		,2449,2450,5298,5305,2388,2402,381,864,419,6327,854,849,5315,391,466,467,468,414,881,432,886,110,888,418,2436,2460,5319,5318,5314,5313,601,2439,2475,2487,6323
		,918,5289,5294,6678,916,6724,911,103,107,503,2415,6676,6677,6681,6682,6685,6686,64,608,2435,1127,2459,628,500,376,471,2387,63,553,2422,2423,2446,2447,46,62,915
		,895,498,6324,6328,856,853,885,848,880,2413,5292,673,633,465,413,5295,5290,5291,5296,612,2464,554,600,6725,632,910,1126,2434,2457,2458,2456,627,852,2496,605,1123
		,2455,497,45,6325,631,2495,887,884,879,2453,2433,2454,2431,2430,2452,2432,2429,847,883,626,40,604,890
    };
    private static final DropSpecialItemAnnounce _instance = new DropSpecialItemAnnounce();

    public static DropSpecialItemAnnounce getInstance()
    {
        return _instance;
    }
    public static void announcements(String text) {
        Collection<Player> players = GameObjectsStorage.getPlayers(false, false);
        Announcements instance = Announcements.getInstance();
        Announcements.Announce announce = instance.new Announce(0, text);
        for (Player player : players) {
            announce.showAnnounce(player);
        }
    }
    public String getWord(){
        String[] words = wordsSimple;
        int roll = Rnd.get(words.length);
        return words[roll];
    }

}


